In [1]:
import gspread as gs
import pandas as pd
import numpy as np

In [2]:
# link https://docs.google.com/spreadsheets/d/1930Y-bAdq178Df1a1RWD6ssu0C9LqdZ2QUg0arngnlc/edit?usp=sharing
gc = gs.service_account(filename='project1-302506-631bfb7f087c.json')

In [3]:
sh = gc.open_by_url('https://docs.google.com/spreadsheets/d/1930Y-bAdq178Df1a1RWD6ssu0C9LqdZ2QUg0arngnlc/edit?usp=sharing')
ws1 = sh.worksheet('Sheet1')
ws2 = sh.worksheet('Sheet2')

In [4]:
df1 = pd.DataFrame(ws1.get_all_records())
df2 = pd.DataFrame(ws2.get_all_records())
df2['gdp'] = pd.to_numeric(df2['gdp'])
df2['Year'] = pd.to_numeric(df2['Year'])

df2.head()

     Region         Subregion        Country       gdp  Year
0      Asia      Eastern Asia          China  26656766  2021
1  Americas  Northern America  United States  22675271  2021
2      Asia     Southern Asia          India  11200000  2021
3      Asia      Eastern Asia          Japan   5585786  2021
4    Europe    Western Europe        Germany   4743673  2021

In [5]:
display(df2.dtypes)

Region       object
Subregion    object
Country      object
gdp           int64
Year          int64
dtype: object

In [6]:
v = df2[['Region','Subregion']] ; v

       Region         Subregion
0        Asia      Eastern Asia
1    Americas  Northern America
2        Asia     Southern Asia
3        Asia      Eastern Asia
4      Europe    Western Europe
..        ...               ...
223   Oceania         Polynesia
224   Oceania         Polynesia
225    Africa    Western Africa
226   Oceania         Polynesia
227   Oceania         Polynesia

[228 rows x 2 columns]

In [7]:
v = df2.loc[:, ['Region']].drop_duplicates() ;v

      Region
0       Asia
1   Americas
4     Europe
17   Oceania
20    Africa

In [8]:
v = df2.query("Country == 'Finland'") ;v

    Region        Subregion  Country     gdp  Year
58  Europe  Northern Europe  Finland  286858  2021

In [9]:
v = df2.sort_values(['Region'],ascending=True).groupby('Year').head(1) ;v

     Region        Subregion                Country    gdp  Year
155  Africa   Western Africa                   Togo  19199  2021
162  Africa  Southern Africa               Eswatini  10424  2020
208  Africa    Middle Africa  SÃ£o TomÃ© and PrÃ­ncipe    875  2019

In [10]:
v = df2.loc[:, ['Region', 'Country']].tail(5) ;v

      Region            Country
223  Oceania  Wallis and Futuna
224  Oceania             Tuvalu
225   Africa       Saint Helena
226  Oceania               Niue
227  Oceania            Tokelau

In [11]:
v = df2.loc[:, ['gdp']].min() ;v

gdp    0
dtype: int64

In [12]:
v = df2.loc[:, ['gdp']].count() ;v

gdp    228
dtype: int64

In [19]:
v = df2.loc[:, ['gdp']].mean() ;v

gdp    628205.609649
dtype: float64

In [14]:
v = df2.loc[df2['Region'] != 'Oceania', ['Country', 'gdp']] ;v

                       Country       gdp
0                        China  26656766
1                United States  22675271
2                        India  11200000
3                        Japan   5585786
4                      Germany   4743673
..                         ...       ...
213     British Virgin Islands         0
218  Saint Pierre and Miquelon         0
220           Falkland Islands         0
221                   Anguilla         0
225               Saint Helena         0

[205 rows x 2 columns]

In [24]:
v = df2.loc[df2['gdp'] > 10000000, ['Country', 'gdp'] ].sort_values(by=['gdp'], ascending=False).drop_duplicates() ;v

         Country       gdp
0          China  26656766
1  United States  22675271
2          India  11200000

In [16]:
v = df2.loc[df2['Region'] != 'Oceania', ['Country', 'gdp']] ;v

                       Country       gdp
0                        China  26656766
1                United States  22675271
2                        India  11200000
3                        Japan   5585786
4                      Germany   4743673
..                         ...       ...
213     British Virgin Islands         0
218  Saint Pierre and Miquelon         0
220           Falkland Islands         0
221                   Anguilla         0
225               Saint Helena         0

[205 rows x 2 columns]

In [25]:
df2.head()

     Region         Subregion        Country       gdp  Year
0      Asia      Eastern Asia          China  26656766  2021
1  Americas  Northern America  United States  22675271  2021
2      Asia     Southern Asia          India  11200000  2021
3      Asia      Eastern Asia          Japan   5585786  2021
4    Europe    Western Europe        Germany   4743673  2021

In [38]:
v = df2.loc[:, ['Region', 'gdp'] ].groupby(['Region']).sum().sort_values(by=['gdp'], ascending=False) ;v

               gdp
Region
Asia      69106178
Americas  34985990
Europe    30557434
Africa     6887139
Oceania    1694138

In [49]:
v = df2['gdp'] = np.where(df2['Subregion'] == 'Polynesia', df2['gdp']+1, df2['gdp']) ;v

array([26656767, 22675271, 11200001,  5585787,  4743673,  4328122,
        3507240,  3328459,  3231927,  3174921,  2749571,  2613797,
        2610563,  2436873,  1959037,  1978816,  1705520,  1415564,
        1403664,  1363766,  1346225,  1329325,  1148581,  1148055,
        1116255,  1110076,  1055502,  1015008,  1000618,   978782,
         966486,   780262,   753113,   683183,   660862,   636481,
         623720,   600064,   589751,   576106,   526747,   517860,
         514748,   500270,   491535,   472396,   460933,   439262,
         413317,   399489,   374994,   370497,   359048,   342708,
         325304,   306998,   291495,   151867,   286858,   293485,
         258678,   273041,   270014,   262669,   226566,   219841,
         208324,   208957,   201194,   192626,   190277,   185742,
         186682,   174998,        0,   171006,   158570,   156038,
         144737,   138999,        0,   131807,   142285,   127325,
         119532,   112273,   114035,   122630,   109297,   107095,
         114896,   105063,    92083,   101950,   106138,    78932,
          98929,   104540,   136345,    85889,    83371,    83170,
          77625,    78309,    78066,    61624,    64043,    64638,
          63539,    62798,    62412,    57952,    58227,    57649,
          51996,    52813,    49987,    50225,    46350,    43389,
          41794,    43553,    44616,   151867,    42413,    40501,
          23501,    35464,    36413,    37272,    36964,    36673,
          35906,    39093,    35420,    37236,    34189,    34676,
          33162,    29583,    31848,    27909,    28209,    29732,
          27421,    26485,    24843,    25409,    11126,    21520,
          21680,    21576,    20005,    14574,    11693,    19199,
          13254,    14449,    13313,    18357,    12101,        0,
          10424,     8973,     8992,     8978,     9446,     6706,
              0,     7706,        0,     5904,        0,     6040,
           5942,        0,        1,        0,        0,     4985,
              0,     4193,     4136,     4469,     3852,        0,
           3499,        0,        0,        0,     2561,     2539,
           2626,     2785,        0,     1804,     2086,        0,
              0,     1747,     1662,        0,     1418,     1196,
              0,     1078,        0,      816,      875,      841,
            617,        1,        0,        0,      354,        1,
            229,      270,        0,      210,        0,        0,
            132,        1,       53,        0,        1,        1],
      dtype=int64)

In [51]:
v = df2.loc[:, ['Region', 'Country']].drop_duplicates() ;v

       Region            Country
0        Asia              China
1    Americas      United States
2        Asia              India
3        Asia              Japan
4      Europe            Germany
..        ...                ...
223   Oceania  Wallis and Futuna
224   Oceania             Tuvalu
225    Africa       Saint Helena
226   Oceania               Niue
227   Oceania            Tokelau

[227 rows x 2 columns]

In [17]:
v = df2.groupby(['Subregion']).apply(lambda x: x.sort_values(['gdp'], ascending=False)).head(3) ;v

                             Region               Subregion  \
Subregion
Australia, New Zealand 17   Oceania  Australia, New Zealand
                       64   Oceania  Australia, New Zealand
Caribbean              67  Americas               Caribbean

                                      Country      gdp  Year
Subregion
Australia, New Zealand 17           Australia  1415564  2021
                       64         New Zealand   226566  2021
Caribbean              67  Dominican Republic   208957  2021